# MEME LANGUAGE | CAT LANG FROM Кіт
# COMMANDS

change-locale = Для зміни мови, Тапни лапкоб на одну з кнопокок нижче.
    To change the language, please click on one of the buttons below.
    Бажаєш допомогти з перекладом? Потапай лапками літерки про це @pvlvld.
    /about - Про цього котика:3

    Зараз котик тапає: {$language} мовою.

start = 🌻 Бот СоНявшник | Нявстистика – наймуркотливіший спосіб слідкувати за кількістю нявчання вашого чатику! 🐾

    🔍 Що вміє цей пухнастик?

    📊 Відображає Нявстистику за КіткоДень, Мурждень, Мяусяць або будь-який муркотливий період.
    🎨 Генерує унікальні графіки нявстистики з власними фонами та кольорами :3
    🧹 Прибирає безмуркоття: ховає тих, хто давно не нявкав, чистить чатики від тиші. 
    ⚙️ Можливість обмежити виклики нявстистики, вимкнути посилання на профілі Котиків, тощо.
    🌟 Унікальна фішка: персоналізуй фон нявграфіків для себе або всього чатику! Завантажуйте мурзображення і створюйте атмосферу 😽

    💬 Додавайте СоНявшника до вашого чату, дивіться хто мурчить найчастіше, і зробіть ваше котозібрання ще муркотливішим і Нявфстичним!
    👉 Дізнайтесь більше туть: soniashnyk.t.me

help = 🌻Бот Нявстистики СоНявшник.
    <b>Дізнайтесь нявстистику та кількість нявчання у вашому нявстичниму чатику:</b>

    📊 <b>Нявстика | /stats</b>: стата вчора, день, тиждень, місяць, рік, за датою (наприклад ось так котику, <code>/stats 2024.01.01</code> або <code>/stats 2024.01.01 2024.06.01</code>).

    📈 <b>/i | !я</b>: переглянути свою Нявстистику.

    📈 <b>/i</b>: переглянути особистий топ чатиків та Нявстистику (в діалозі з цим пухнастиком).

    📈 <b>/you | !ти</b>: переглянути чужу Нявстистику (юзернейм, ім'я або у відповідь).

    📉 <b>!інактив X / !неактив X</b>: переглянути сторінку Нявчання чату від найстарішого (замість X номер сторіночки).

    💅🏻 <b>!стата фон я | /setMyBg</b>: Зміна фону для командочок !я та !ти (команду потрібненько писати в описі до зображення). Працює у всіх чатиках.

    💅🏻 <b>!стата фон чат | /setChatBg</b>: Зміна фону для командочок Нявстистики чатика (команду потрібно писати в описі до зображення).

    💅🏻 <b>!стата колір</b>: Зміна кольорів графіку чи шрифтика в Нявстистиці. (потрібненько закинути на корм(Донатик 15грн в приватні пухнастику))

    🏷 <b>/nick | +нік X</b>: встановити бажаний тобою нікнейм (замість X). Видалити злі нікнейм: -нік.

    🧹 <b>!чистка X Y</b>: Наприклад от котику, !чистка 7 100 — мінімум 100 повідомлень за останні 7 днів.

    🛏 <b>!рест</b>: захистити Котика від чистки (за ім'ям, юзернеймом або у відповідь).

    🫣 <b>!ссприховати</b>: приховати Котика зі Нявстистики / скинути дату першої появи пухнастика (за ім'ям, юзернеймом або у відповідь).

    💸 <b>/refreshDonate</b>: Оновити ваш статус Годувача СоНявшника чи чатика.(Після того як закинув донатик)

    ⚙️ <b>/settings</b>: Налаштування цього чатика :3

    🖼 Графіки Нявстистики працюють лише для Нявстистики від 3х Кітикоднів. Якщо ви тільки додали цього Пухнастика, то вони скоро з'являться 🐾😉!

    Мій канал: soniashnyk.t.me

donate-private = <u>Особистий</u> преміум!

    За підтримку від 15грн вам буде доступно:
    - Встановлення гіфки на фон Нявститики
    - Зміна кольорів графіку та шрифту вашої Нявстистики 🐾
    - Встановлення власного емоджі заклику й дати стосунків в @soniashnyk_call_bot і @soniashnyk_bot
    - Зміна дати початку стосунків ;3

    Щоб отримати преміум для чатика, скористайтесь цією командою безпосередньо в ньому.
    Після Підтримки/донату скористайтесь коандою /refreshDonate, якщо статус Годувальника/Донатери не було видано.

donate-group = Преміумчик для <u>чату</u>!🐾

    За донатик від 30грн вам буде доступно:
    - Можливість застосувати фон для чатика і для Нявстистики Пухнастиків
    - Встановлення гіфку на фон чатика
    - Зміна кольорів графіку та шрифту Нявстистики чатика
    - 10 власних команд в @soniashnyk_bot ;3
    - Гра «Крокодил» в @soniashnyk_bot
    - Відсуність реклами від цього Пухнастика(бота)
    
    Оплату може здійснити будь-який учасник чатика.
    Щоб отримати преміум для власного акаунту, скористайтесь командою /donate в діалозі з СоНявшником Нявстистикою.
    Після донату скористайтесь командочкою /refreshDonate, якщо статус Годувальника/донатера не було видано:c

error = Щось пішло не так. Цей котик погано це почуває. Напишіть про це в @soniashnyk_chat / @pvlvld / @uli_sunflower

unknown = невідомо

user-not-found = ❌ Пухнастика або котика не знайдено.

active-del-success = ✅ Успішно видалено {$name} з Активчика та приховано зі Нявстистики.

only_private_cmd = Ця команда працює лише в <a href="https://t.me/soniashnyk_statistics_bot?text={$command}">особистих повідомленнях з Сонявшник Нявстистикою.</a>

chart-bg-change-success = 💅🏻 Фон успішно оновлено ^^!

chart-bg-save-fail = Не вдалося зберегти зображення:с Будь ласка спробуй знову.

chart-bg-resize-fail = Не вдалося змінити розмір зображення:с Будь ласка спробуй знову.

chart-bg-how-to-use = Надішліть командочку у відповідь на фото/гіфку🐾.

chart-bg-change-restricted = Вам тимчасово заборонено змінювати фони. Бо ви злі :⁰

chart-bg-animation-donate-only = Анімовані фони доступні лише пухнастикам донатерам мухехе - /donate

anon-user-unsupported-error = Схоже, що ви пишете від імені чатика або каналу. Це не підтримується. Пухнастику спробуй ще раз без анонімості телеграм.

inactive-enter-page = Введіть номер сторіночки.
    !неактив 1

empty-page-error = Ця сторінка порожненька:с

settings-message = Налаштування СоНявшник | Нявстистика

    Графіки Нявстистики {$charts}
    Фон чатика для команд !я та !ти {$usechatbgforall}
    Команди Нявстистики лише для адмінів {$statsadminsonly}
    Самознищення повідомлень {$selfdestructstats}
    Покликання на профілі {$userstatslink}

nick-max-length-error = Максимальна довжина нікнейму 20 символів. Скороти нікнейм :3

nick-del-success = ✅ Нікнейм видалено:⁰

nick-set-success = ✅ Успішно встановлено нікнейм: {$nickname}. ^^!

stats-empty-date = Схоже, що ніхто не нявчав тоді.

stats-date-help = Команда має мати такий формат:
    "стата 2025.04.13" або "/stats 2025.04.01 2025.04.14"

stats-chat-period = 📊 Нявстистика{$title} за {$period}

stats-total-amount = Загальна кількість Нявчання

# "today" | "yesterday" | "weekRange" | "monthRange" | "yearRange" | "all"
# stats-chat-period -> $period <-
# Нявстистика чатику за сьогодні / вчора / весь час / ...
stats-period-today = сьогодні
stats-period-yesterday = вчора
stats-period-weekRange = тиждень
stats-period-monthRange = місяць
stats-period-yearRange = рік
stats-period-all = весь час

stats-user-top-chats = Особистий топ де ти багато нявчав{$name}

    <blockquote>{$top}</blockquote>

    Загалом: {$totalMessages} повідомлень ти Нанявчав.

first-user-message = Ого! Схоже, що це ваш перший Няв в цьому чатику 🎉

robot-sounds = 🐈‍⬛ Мур-Няв

stats-user-message = Нявсистика:{$name}

    - Кітикодень: {$today}
    - Мурждень: {$week}
    - Міусяць: {$month}
    - НявоРік: {$year}
    - весь час: {$total}

    📅 Перше Нявчання: {$firstSeen}

stats-global-chats-weekly = Топ чатиків за останній Мурждень:
    
    <blockquote>{$top}</blockquote>

chat-peak-days = Пікові Кітикодні в історії чатика.

# HISTORY SCANNER

history-scan-prompt = Відсканувати історію чатика, щоб старе нявчання відображались в Нявстистиці чатика?🐾

history-scan-already-queued = Ваш чатик вже в черзі на сканування.🐾

history-scan-dont-needed = Немає потреби в скануванні.
    Дата першого запису Нявстистики чатика збігається з датою першого Няву в чаті.

history-scan-nor-invite = Видайте мені дозвіл запрошувати Пухнастиків або зробіть чатик публічним, щоб я зміг додати мого братика сканера. Він не на довго. Тільки відсканувати.

history-scan-cant-start = Не вдалось отримати ідентифікатор чатика для додавання сканеру. Переконайтеся, що я маю право додавати нових Пухнастиків або зробіть чатик публічним.

history-scan-finished = Успішно відскановано та додано в Нявстистику {$count} повідомлень!

history-scan-first-known-msg-older-than-chat = Перше збережене в Нявстистиці повідомлення старіше за перше доступне в чаті.
    Якщо ви вважаєте, що це помилочка чи бажаєте пересканувати чатик, зверніться до адміністратора пухнастика. @soniashnyk_chat / @pvlvld / @uli_sunflower


# CHAT CLEANING

chat-cleanup-usage = Приклад використання:
    !чистка 7 100
    7 - кількість днів, 100 - мінімальна кількість повідомлень за цей час.
chat-cleanup-already-running = В чатику вже запущено чистку. Відмініть її або спробуйте пізніше.
chat-cleanup-nothing-found = За вказаними параметрами знайдено 0 Пухнастиків.
chat-cleanup-text = Знайдено {$targetMembersCount} Пухнастиків, котрі за останні {$targetDaysCount} днів написали менше {$targetMessagesCount} повідомлень. Мало Нявчали:с

chat-cleanup-nor-set-admin = Я не маю дозволу призначати адміністраторів.
    Видайте дозвіл або скористайтесь командою під час чистки.
chat-cleanup-user-protected-admin = {$name} адмін, він не може бути видалений під час чистки та не потребує ресту.
chat-cleanup-user-marked-rest = {$name} помічено як рест.
chat-cleanup-protection-usage = 🛏 <b>!рест</b>: захистити Пухнастика від чистки (за ім'ям, юзернеймом або у відповідь на повідомлення).

    Якщо викликати команду до чистки, тоді я спробую зробити пухнастика адміністратором без прав та встановити їй підпис "рест".
    Якщо викликати команду після команди !чистка, тоді бот видалить людину зі списку.


# BUTTONS misc

button-yes = Яп
button-no = Ніт
button-done = Готово
button-close = Закрити
button-show-commands = Мої команди :⁰
button-add-bot = Додати мене в чатик
button-plz-donate = Задонатити на корм💸🐾
button-change-language-menu = Змінити мову 🐈‍⬛🌏


# MENU SETTINGS

settings-menu-donate-alert = Ця функція доступна тільки пухнастикам донатерам — введіть /donate в потрібному чаті!

settings-menu-charts = Графіки Нявстистики

settings-menu-chat-bg-for-members = Фон чатику для пухнастиків

settings-menu-stats-cmd-admins-only = Команди Нявстистики лише для адмінів

settings-menu-selfdestruct-stats = Самознищення моїх повіомлень

settings-menu-users-link = Посилання на акаунти пухнастиків


# TELEGRAM BOT INTERFACE

bot-name = СоНявшник | Нявстистика

bot-about = Твій улюблений Пухнастик Нявстистики! 😉

    Графіки з особистим фоном!
    Нявстистика за будь-який день та період!
    Канал: @soniashnyk

bot-description = Твій улюблений Пухнастик Нявстистики! 😉

bot-command-about = Про мене
bot-command-help = Команди та мої функції
bot-command-donate = Підтримати мене
bot-command-i = Моя Нявстистика
bot-command-you = Нявсистика Пухнастика
bot-command-stats = Нявстистика чатика
bot-command-statsall = Нявстистика чатику за весь час
bot-command-settings = Мої Налаштування
bot-command-tchats = Рейтинг чатиків в приватних
bot-command-w = Нявстистика за Мурждень
bot-command-m = Статистика за Міусяць
bot-command-y = Статистика за НявоРік
bot-command-nick = Змінити нік
bot-command-setchatbg = Змінити фон чатика
bot-command-setmybg = Змінити мій фон
bot-command-lang = Змінити мою мову
bot-command-peakdays = Пікові дні в історії чатика

# ERRORS

error-ner-photos = У мене немає прав надсилати зображення, графіки було вимкнуто:с
    Щоб увімкнути їх, видайте мені права та змініть налаштування в /settings

error-smtn-went-wrong-call-admin = Щось пішло не так. Спробуйте пізніше або повідомте адміністратору бота. @soniashnyk_chat / @pvlvld / @uli_sunflower

error-chat-owner-only = Дозволено лише власнику чату.