# COMMANDS

start = 🌻 Бот Соняшник | Статистика – найзручніший спосіб слідкувати за активністю вашого чату!

    🔍 Що вміє бот?

    📊 Відображає статистику за день, тиждень, місяць або будь-який період.
    🎨 Генерує унікальні графіки статистики з власними фонами та кольорами.
    🧹 Інструменти для управління активністю учасників: чистка неактивних, приховування користувачів зі статистики.
    ⚙️ Можливість обмежити виклики статистики, вимкнути посилання на акаунти, тощо.
    🌟 Унікальна функція: персоналізуйте фон графіків для себе та чату власними зображеннями!

    Додавайте бота, досліджуйте активність та зробіть ваш чат ще цікавішим! 💬
    👉 Дізнайтесь більше: soniashnyk.t.me

hello = Привіт! Я неймовірно радий, що ви додали мене до свого чату ❤️
    Аби ми краще познайомились, я хочу розказати вам трішки про свою сім'ю.

    <a href="https://soniashnyk_bot.t.me">Соняшник</a>
    Він найстарший та має найбільше функцій: РП, стосунки, адміністрування, рандом та навіть гру в Крокодила!

    <a href="https://soniashnyk_statistics_bot.t.me">Соняшник | Статистика</a>
    Збирає статистику, малює її графіки з вашим особистим фоном, а також дуже допомагає в автоматизації чистки!

    <a href="https://soniashnyk_call_bot.t.me">Соняшник | Заклик</a>
    Швидко збере всіх учасників чату

help = 🌻Бот статистики Соняшник.
    <b>Дізнайтесь статистику та активність у вашому чаті:</b>

    📊 <b>Статистика</b>: стата вчора, день, тиждень, місяць, рік, за датою (наприклад, <code>стата 2024.01.01</code> або <code>стата 2024.01.01 2024.06.01</code>).

    📈 <b>!я</b>: переглянути свою статистику.

    📈 <b>!ти</b>: переглянути чужу статистику (юзернейм, ім'я або у відповідь).

    📉 <b>!інактив X / !неактив X</b>: переглянути сторінку активу чату від найстарішого (замість X номер сторінки).

    💅🏻 <b>!стата фон я /setMyBg</b>: Зміна фону для команд !я та !ти (команду потрібно писати в описі до зображення). Працює у всіх чатах.

    💅🏻 <b>!стата фон чат /setChatBg</b>: Зміна фону для команд статистики чату (команду потрібно писати в описі до зображення).

    💅🏻 <b>!стата колір</b>: Зміна кольоруy графіку чи шрифту в статистиці. (донат)

    🏷 <b>+нік X</b>: встановити бажаний нікнейм (замість X). Видалити нікнейм: -нік.

    🧹 <b>!чистка X Y</b>: Наприклад, !чистка 7 100 — мінімум 100 повідомлень за останні 7 днів.

    🛏 <b>!рест</b>: захистити людину від чистки (за ім'ям, юзернеймом або у відповідь).

    🫣 <b>!ссприховати</b>: приховати людину зі статистики / скинути дату першої появи (за ім'ям, юзернеймом або у відповідь).

    📅 <b>!дата вступу</b>: зміна дати вступу.

    💸 <b>/refreshDonate</b>: Оновити ваш статус донатера чи чату.

    ⚙️ <b>!налаштування /settings</b>: Налаштування чату.

    🖼 Графіки статистики працюють лише для статистики від 3х днів. Якщо ви тільки додали бота, то вони скоро з'являться 😉!

    Мій канал: soniashnyk.t.me

donate-private = <u>Особистий</u> преміум!

    За донат від 15грн вам буде доступно:
    -Зміна кольорів графіку та шрифту вашої статистики
    -Встановлення власного емоджі заклику й дати стосунків в @soniashnyk_bot.
    -Зміна дати початку стосунків.

    Щоб отримати преміум для чату, скористайтесь цією командою безпосередньо в ньому.
    Після донату скористайтесь коандою /refreshDonate, якщо статус донатера не було видано.

donate-group = Преміум для <u>чату</u>!

    За донат від 30грн вам буде доступно:
    - Можливість застосувати фон чату для статистики користувачів
    - Зміна кольорів графіку та шрифту статистики чату
    - 10 власних команд в @soniashnyk_bot
    - Гра «Крокодил» в @soniashnyk_bot.
    - Відсуність реклами від бота.
    
    Оплату може здійснити будь-який учасник чату.
    Щоб отримати преміум для власного акаунту, скористайтесь командою /donate в діалозі з ботом.
    Після донату скористайтесь коандою /refreshDonate, якщо статус донатера не було видано.

error = Щось пішло не так.

unknown = невідомо

user-not-found = ❌ Користувача не знайдено.

active-del-success = ✅ Успішно видалено {$name} з активу та приховано зі статистики.

nick-del-success = ✅ Нікнейм видалено.
# MENUS

# ETC