# COMMANDS

change-locale = Для зміни мови, натисніть на одну з кнопок нижче.
    To change the language, please click on one of the buttons below.
    Бажаєш допомогти з перекладом? Пиши @pvlvld.
    /about - Про бота.

    Зараз обрано: {$language}

start = 🌻 Бот Соняшник | Статистика – найзручніший спосіб слідкувати за активністю вашого чату!

    🔍 Що вміє бот?

    📊 Відображає статистику за день, тиждень, місяць або будь-який період.
    🎨 Генерує унікальні графіки статистики з власними фонами та кольорами.
    🧹 Інструменти для управління активністю учасників: чистка неактивних, приховування користувачів зі статистики.
    ⚙️ Можливість обмежити виклики статистики, вимкнути посилання на акаунти, тощо.
    🌟 Унікальна функція: персоналізуйте фон графіків для себе та чату власними зображеннями!

    Додавайте бота, досліджуйте активність та зробіть ваш чат ще цікавішим! 💬
    👉 Дізнайтесь більше: soniashnyk.t.me

help = 🌻Бот статистики Соняшник.
    <b>Дізнайтесь статистику та активність у вашому чаті:</b>

    📊 <b>Статистика | /stats</b>: стата вчора, день, тиждень, місяць, рік, за датою (наприклад, <code>/stats 2024.01.01</code> або <code>/stats 2024.01.01 2024.06.01</code>).

    📈 <b>/i | !я</b>: переглянути свою статистику.

    📈 <b>/i</b>: переглянути особистий топ чатів та статистику (в діалозі з ботом).

    📈 <b>/you | !ти</b>: переглянути чужу статистику (юзернейм, ім'я або у відповідь).

    📉 <b>!інактив X / !неактив X</b>: переглянути сторінку активу чату від найстарішого (замість X номер сторінки).

    💅🏻 <b>!стата фон я | /setMyBg</b>: Зміна фону для команд !я та !ти (команду потрібно писати в описі до зображення). Працює у всіх чатах.

    💅🏻 <b>!стата фон чат | /setChatBg</b>: Зміна фону для команд статистики чату (команду потрібно писати в описі до зображення).

    💅🏻 <b>!стата колір</b>: Зміна кольоруy графіку чи шрифту в статистиці. (донат)

    🏷 <b>/nick | +нік X</b>: встановити бажаний нікнейм (замість X). Видалити нікнейм: -нік.

    🧹 <b>!чистка X Y</b>: Наприклад, !чистка 7 100 — мінімум 100 повідомлень за останні 7 днів.

    🛏 <b>!рест</b>: захистити людину від чистки (за ім'ям, юзернеймом або у відповідь).

    🫣 <b>!ссприховати</b>: приховати людину зі статистики / скинути дату першої появи (за ім'ям, юзернеймом або у відповідь).

    💸 <b>/refreshDonate</b>: Оновити ваш статус донатера чи чату.

    ⚙️ <b>/settings</b>: Налаштування чату.

    🖼 Графіки статистики працюють лише для статистики від 3х днів. Якщо ви тільки додали бота, то вони скоро з'являться 😉!

    Мій канал: soniashnyk.t.me

donate-private = <u>Особистий</u> преміум!

    За донат від 15грн вам буде доступно:
    - Встановлення гіф на фон стати
    - Зміна кольорів графіку та шрифту вашої статистики
    - Встановлення власного емоджі заклику й дати стосунків в @soniashnyk_bot
    - Зміна дати початку стосунків

    Щоб отримати преміум для чату, скористайтесь цією командою безпосередньо в ньому.
    Після донату скористайтесь коандою /refreshDonate, якщо статус донатера не було видано.

donate-group = Преміум для <u>чату</u>!

    За донат від 30грн вам буде доступно:
    - Можливість застосувати фон чату для статистики користувачів
    - Встановлення гіф на фон чату
    - Зміна кольорів графіку та шрифту статистики чату
    - 10 власних команд в @soniashnyk_bot
    - Гра «Крокодил» в @soniashnyk_bot
    - Відсуність реклами від бота
    
    Оплату може здійснити будь-який учасник чату.
    Щоб отримати преміум для власного акаунту, скористайтесь командою /donate в діалозі з ботом.
    Після донату скористайтесь коандою /refreshDonate, якщо статус донатера не було видано.

error = Щось пішло не так.

unknown = невідомо

user-not-found = ❌ Користувача не знайдено.

active-del-success = ✅ Успішно видалено {$name} з активу та приховано зі статистики.

only_private_cmd = Ця команда працює лише в <a href="https://t.me/soniashnyk_statistics_bot">особистих повідомленнях з ботом.</a>

chart-bg-change-success = 💅🏻 Фон успішно оновлено!

chart-bg-save-fail = Не вдалося зберегти зображення. Спробуйте знову.

chart-bg-resize-fail = Не вдалося змінити розмір зображення. Спробуйте знову.

chart-bg-how-to-use = Надішліть команду у відповідь на фото/гіф.

chart-bg-change-restricted = Вам тимчасово заборонено змінювати фони.

chart-bg-animation-donate-only = Анімовані фони доступні лише донатерам /donate

anon-user-unsupported-error = Схоже, що ви пишете від імені чату або каналу. Це не підтримується.

inactive-enter-page = Введіть номер сторінки.
    !неактив 1

empty-page-error = Ця сторінка порожня.

settings-message = Налаштування Соняшник | Статистика

    Графіки статистики {$charts}
    Фон чату для команд !я та !ти {$usechatbgforall}
    Команди статистики лише для адмінів {$statsadminsonly}
    Самознищення повідомлень {$selfdestructstats}
    Покликання на акаунти {$userstatslink}

nick-max-length-error = Максимальна довжина нікнейму 20 символів.

nick-del-success = ✅ Нікнейм видалено.

nick-set-success = ✅ Успішно встановлено нікнейм: {$nickname}!

stats-empty-date = Схоже, що статистики за цю дату немає.

stats-date-help = Команда має мати такий формат:
    "стата 2025.04.13" або "/stats 2025.04.01 2025.04.14"

stats-chat-period = 📊 Статистика{$title} за {$period}

stats-total-amount = Загальна кількість

# "today" | "yesterday" | "weekRange" | "monthRange" | "yearRange" | "all"
# stats-chat-period -> $period <-
# Статистика чату за сьогодні / вчора / весь час / ...
stats-period-today = сьогодні
stats-period-yesterday = вчора
stats-period-weekRange = тиждень
stats-period-monthRange = місяць
stats-period-yearRange = рік
stats-period-all = весь час

stats-user-top-chats = Особистий топ чатів{$name}

    <blockquote>{$top}</blockquote>

    Загалом: {$totalMessages} повідомлень.

first-user-message = Схоже, що це ваше перше повідомлення в цьому чаті 🎉

robot-sounds = 🤖 біп-буп

stats-user-message = Статистика{$name}

    - день: {$today}
    - тиждень: {$week}
    - місяць: {$month}
    - рік: {$year}
    - весь час: {$total}

    📅 Перше повідомлення: {$firstSeen}

stats-global-chats-weekly = Топ чатів за останній тиждень:
    
    <blockquote>{$top}</blockquote>

chat-peak-days = Пікові дні в історії чату.

# HISTORY SCANNER

history-scan-prompt = Відсканувати історію чату, щоб старі повідомлення відображались в статистиці чату?

history-scan-already-queued = Ваш чат вже в черзі на сканування.

history-scan-dont-needed = Немає потреби в скануванні.
    Дата першого запису статистики чату збігається з датою першого повідомлення в чаті.

history-scan-nor-invite = Видайте мені дозвіл запрошувати учасників або зробіть чат публічним, щоб я зміг додати сканер.

history-scan-cant-start = Не вдалось отримати ідентифікатор чату для додавання сканеру. Переконайтеся, що я маю право додавати нових учасників або зробіть чат публічним.

history-scan-finished = Успішно відскановано та додано в статистику {$count} повідомлень!

history-scan-first-known-msg-older-than-chat = Перше збережене в статистиці повідомлення старіше за перше доступне в чаті.
    Якщо ви вважаєте, що це помилка чи бажаєте пересканувати чат, зверніться до адміністратора бота.


# CHAT CLEANING

chat-cleanup-usage = Приклад використання:
    !чистка 7 100
    7 - кількість днів, 100 - мінімальна кількість повідомлень за цей час.
chat-cleanup-already-running = В чаті вже запущено чистку. Відмініть її або спробуйте пізніше.
chat-cleanup-nothing-found = За вказаними параметрами знайдено 0 учасників.
chat-cleanup-text = Знайдено {$targetMembersCount} учасників, котрі за останні {$targetDaysCount} днів написали менше {$targetMessagesCount} повідомлень.

chat-cleanup-nor-set-admin = Бот не має дозволу призначати адміністраторів.
    Видайте дозвіл або скористайтесь командою під час чистки.
chat-cleanup-user-protected-admin = {$name} адмін, він не може бути видалений під час чистки та не потребує ресту.
chat-cleanup-user-marked-rest = {$name} помічено як рест.
chat-cleanup-protection-usage = 🛏 <b>!рест</b>: захистити людину від чистки (за ім'ям, юзернеймом або у відповідь на повідомлення).

    Якщо викликати команду до чистки, тоді бот спробує зробити людину адміністратором без прав та встановити їй підпис "рест".
    Якщо викликати команду після команди !чистка, тоді бот видалить людину зі списку.


# BUTTONS misc

button-yes = Так
button-no = Ні
button-done = Готово
button-close = Закрити
button-show-commands = Команди бота
button-add-bot = Додати бота в чат
button-plz-donate = Задонатити 💸🫰🏻
button-change-language-menu = Змінити мову 🗣🌏


# MENU SETTINGS

settings-menu-donate-alert = Ця функція доступна донатерам — введіть /donate в потрібному чаті!

settings-menu-charts = Графіки статистики

settings-menu-chat-bg-for-members = Фон чату для учасників

settings-menu-stats-cmd-admins-only = Команди статистики лише для адмінів

settings-menu-selfdestruct-stats = Самознищення повіомлень бота

settings-menu-users-link = Посилання на акаунти учасників


# TELEGRAM BOT INTERFACE

bot-name = Соняшник | Статистика

bot-about = Твій улюблений бот статистики! 😉

    Графіки з особистим фоном!
    Статистика за будь-який день та період!
    Канал: @soniashnyk

bot-description = Твій улюблений бот статистики! 😉

bot-command-about = Про бота
bot-command-help = Команди та функції бота
bot-command-donate = Підтримати бота
bot-command-i = Моя статистика
bot-command-you = Статистика учасника
bot-command-stats = Статистика чату
bot-command-statsall = Статистика чату за весь час
bot-command-settings = Налаштування бота
bot-command-tchats = Рейтинг чатів
bot-command-w = Статистика за тиждень
bot-command-m = Статистика за місяць
bot-command-y = Статистика за рік
bot-command-nick = Змінити нік
bot-command-setchatbg = Змінити фон чату
bot-command-setmybg = Змінити мій фон
bot-command-lang = Змінити мову бота

# ERRORS

error-ner-photos = У бота немає прав надсилати зображення, графіки було вимкнуто.
    Щоб увімкнути їх, видайте боту права та змініть налаштування в /settings

error-smtn-went-wrong-call-admin = Щось пішло не так. Спробуйте пізніше або повідомте адміністратору бота.

error-chat-owner-only = Дозволено лише власнику чату.